src/domain/sci/transporter/broker/dhl/dhl-request-DOX.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
               xmlns:tns="http://scxgxtt.phx-dc.dhl.com/euExpressRateBook/ShipmentMsgRequest">
  <soap:Header>
    <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
      <wsse:UsernameToken>
        <wsse:Username>esendeoFR</wsse:Username>
        <wsse:Password
          Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">
          N$8nL!3tG#6b
        </wsse:Password>
      </wsse:UsernameToken>
    </wsse:Security>
  </soap:Header>
  <soap:Body>
    <tns:ShipmentRequest>
      <RequestedShipment>
        <ShipmentInfo>
          <DropOffType>REGULAR_PICKUP</DropOffType>
          <ServiceType>N</ServiceType>
          <Billing>
            <ShipperAccountNumber>220370316</ShipperAccountNumber>
            <ShippingPaymentType>S</ShippingPaymentType>
            <BillingAccountNumber>220370316</BillingAccountNumber>
          </Billing>
          <Currency>EUR</Currency>
          <UnitOfMeasurement>SI</UnitOfMeasurement>
          <LabelTemplate>ECOM26_64_002</LabelTemplate>
          <SpecialServices>
            <Service>
              <ServiceType>II</ServiceType>
              <ServiceValue>12</ServiceValue>
              <CurrencyCode>EUR</CurrencyCode>
            </Service>
          </SpecialServices>
        </ShipmentInfo>
        <ShipTimestamp>2021-09-17T15:35:56GMT+08:00</ShipTimestamp>
        <PaymentInfo>DAP</PaymentInfo>
        <InternationalDetail>
          <Commodities>
            <Description>gift</Description>
            <CustomsValue>17.78</CustomsValue>
          </Commodities>
          <Content>DOCUMENTS</Content>
        </InternationalDetail>
        <Ship>
          <Shipper>
            <Contact>
              <PersonName>xie</PersonName>
              <CompanyName>LYONEXPRESS</CompanyName>
              <PhoneNumber>0981611051</PhoneNumber>
            </Contact>
            <Address>
              <StreetLines>19 RUE ELIE ROCHETTE</StreetLines>
              <City>LYON</City>
              <PostalCode>69007</PostalCode>
              <CountryCode>FR</CountryCode>
            </Address>
          </Shipper>
          <Recipient>
            <Contact>
              <PersonName>ke</PersonName>
              <CompanyName>Old Town Hotel</CompanyName>
              <PhoneNumber>+40356880300</PhoneNumber>
            </Contact>
            <Address>
              <StreetLines>54 Av. de la République</StreetLines>
              <City>paris</City>
              <PostalCode>94800</PostalCode>
              <CountryCode>FR</CountryCode>
            </Address>
          </Recipient>
        </Ship>
        <Packages>
          <RequestedPackages number="2">
            <Weight>2</Weight>
            <Dimensions>
              <Length>1.0</Length>
              <Width>1.0</Width>
              <Height>1.0</Height>
            </Dimensions>
            <CustomerReferences>807873</CustomerReferences>
          </RequestedPackages>
        </Packages>
      </RequestedShipment>
    </tns:ShipmentRequest>
  </soap:Body>
</soap:Envelope>
